aroyer-qc/Digini/Peripheral/inc/port/STM32F4xx/lib_STM32F4_io.h
//-------------------------------------------------------------------------------------------------
//
//  File : lib_STM32F4_io.h
//
//-------------------------------------------------------------------------------------------------
//
// Copyright(c) 2020 Alain Royer.
// Email: aroyer.qc@gmail.com
//
// Permission is hereby granted, free of charge, to any person obtaining a copy of this software
// and associated documentation files (the "Software"), to deal in the Software without
// restriction, including without limitation the rights to use, copy, modify, merge, publish,
// distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the
// Software is furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included in all copies or
// substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
// INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
// AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
// DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
//
//-------------------------------------------------------------------------------------------------

#pragma once

//-------------------------------------------------------------------------------------------------
// Define(s) and macro(s)
//-------------------------------------------------------------------------------------------------

#define IO_PIN_0                 	    ((uint16_t)0x0001)
#define IO_PIN_1                 	    ((uint16_t)0x0002)
#define IO_PIN_2                 	    ((uint16_t)0x0004)
#define IO_PIN_3                 	    ((uint16_t)0x0008)
#define IO_PIN_4                 	    ((uint16_t)0x0010)
#define IO_PIN_5                        ((uint16_t)0x0020)
#define IO_PIN_6                        ((uint16_t)0x0040)
#define IO_PIN_7                        ((uint16_t)0x0080)
#define IO_PIN_8                        ((uint16_t)0x0100)
#define IO_PIN_9                        ((uint16_t)0x0200)
#define IO_PIN_10                       ((uint16_t)0x0400)
#define IO_PIN_11                       ((uint16_t)0x0800)
#define IO_PIN_12                       ((uint16_t)0x1000)
#define IO_PIN_13                       ((uint16_t)0x2000)
#define IO_PIN_14                       ((uint16_t)0x4000)
#define IO_PIN_15                       ((uint16_t)0x8000)

#define GPIOxx                          ((uint32_t)0x00000000)

#if defined(STM32F401xE) || defined(STM32F401xC)
#define NUMBER_OF_IO_PORT               ((uint32_t)5)
#elif defined(STM32F40_41xxx)
#define NUMBER_OF_IO_PORT               ((uint32_t)9)
#elif defined(STM32F429xx) || defined(STM32F439xx) || defined(STM32F427xx) || defined(STM32F437xx)
#define NUMBER_OF_IO_PORT               ((uint32_t)11)
#endif

#define NUMBER_OF_PIN_PER_PORT          ((uint32_t)16)

#define LED_Init(p)                     IO_PinInit(p)
#define LED_Toggle(p)                   IO_TogglePin(p)

//#define IO_NULL                       ((IO_TypeDef *)nullptr)

//#define IO_SPEED_PIN_SHIFT            (5)
#define IO_SPEED_PIN_MASK               ((uint32_t)0x00000003)
#define IO_SPEED_FREQ_LOW               ((uint32_t)0x00000000)
#define IO_SPEED_FREQ_MEDIUM            ((uint32_t)0x00000001)
#define IO_SPEED_FREQ_HIGH              ((uint32_t)0x00000002)
#define IO_SPEED_FREQ_VERY_HIGH         ((uint32_t)0x00000003)

#define IO_MODE_PIN_MASK                ((uint32_t)0x00000003)
#define IO_MODE_INPUT                   ((uint32_t)0x00000000)
#define IO_MODE_OUTPUT                  ((uint32_t)0x00000001)
#define IO_MODE_ALTERNATE               ((uint32_t)0x00000002)
#define IO_MODE_ANALOG                  ((uint32_t)0x00000003)

//#define IO_TYPE_SHIFT                 (2)
#define IO_TYPE_PIN_DRIVE_MASK          ((uint32_t)0x00000001)
#define IO_TYPE_PIN_PP                  ((uint32_t)0x00000000)
#define IO_TYPE_PIN_OD                  ((uint32_t)0x00000001)

//#define IO_PULL_SHIFT                 (3)
#define IO_TYPE_PIN_PULL_MASK           ((uint32_t)0x00000006)
#define IO_TYPE_PIN_NO_PULL             ((uint32_t)0x00000000)
#define IO_TYPE_PIN_PULL_UP             ((uint32_t)0x00000002)
#define IO_TYPE_PIN_PULL_DOWN           ((uint32_t)0x00000004)

// TODO need to be validated
// External trigger
#define IO_EXTI_TRIGGER_NONE            ((uint8_t)0) // No Trigger Mode
#define IO_EXTI_TRIGGER_RISING          ((uint8_t)1) // Trigger Rising Mode
#define IO_EXTI_TRIGGER_FALLING         ((uint8_t)2) // Trigger Falling Mode
#define IO_EXTI_TRIGGER_RISING_FALLING  ((uint8_t)3) // Trigger Rising & Falling Mode

//#define IO_AF_SHIFT                   (8)
#define IO_AF_MASK                      ((uint32_t)0x0000000F)

// AF 0 selection
#define IO_AF0                          ((uint8_t)0x00)  // Alternate Function mapping
#define IO_AF0_RTC_50Hz                 ((uint8_t)0x00)  // RTC_50Hz Alternate Function mapping
#define IO_AF0_MCO                      ((uint8_t)0x00)  // MCO (MCO1 and MCO2) Alternate Function mapping
#define IO_AF0_SWJ                      ((uint8_t)0x00)  // SWJ (SWD and JTAG) Alternate Function mapping
#define IO_AF0_TRACE                    ((uint8_t)0x00)  // TRACE Alternate Function mapping
// AF 1 selection
#define IO_AF1                          ((uint8_t)0x01)  // Alternate Function mapping
#define IO_AF1_TIM                      ((uint8_t)0x01)  // TIM Alternate Function mapping
#define IO_AF1_TIM1                     ((uint8_t)0x01)  // TIM1 Alternate Function mapping
#define IO_AF1_TIM2                     ((uint8_t)0x01)  // TIM2 Alternate Function mapping
// AF 2 selection
#define IO_AF2                          ((uint8_t)0x02)  // Alternate Function mapping
#define IO_AF2_TIM                      ((uint8_t)0x02)  // TIM Alternate Function mapping
#define IO_AF2_TIM3                     ((uint8_t)0x02)  // TIM3 Alternate Function mapping
#define IO_AF2_TIM4                     ((uint8_t)0x02)  // TIM4 Alternate Function mapping
#define IO_AF2_TIM5                     ((uint8_t)0x02)  // TIM5 Alternate Function mapping
// AF 3 selection
#define IO_AF3                          ((uint8_t)0x03)  // Alternate Function mapping
#define IO_AF3_TIM                      ((uint8_t)0x03)  // TIM Alternate Function mapping
#define IO_AF3_TIM8                     ((uint8_t)0x03)  // TIM8 Alternate Function mapping
#define IO_AF3_TIM9                     ((uint8_t)0x03)  // TIM9 Alternate Function mapping
#define IO_AF3_TIM10                    ((uint8_t)0x03)  // TIM10 Alternate Function mapping
#define IO_AF3_TIM11                    ((uint8_t)0x03)  // TIM11 Alternate Function mapping
// AF 4 selection
#define IO_AF4                          ((uint8_t)0x04)  // Alternate Function mapping
#define IO_AF4_I2C                      ((uint8_t)0x04)  // I2C Alternate Function mapping
#define IO_AF4_I2C1                     ((uint8_t)0x04)  // I2C1 Alternate Function mapping
#define IO_AF4_I2C2                     ((uint8_t)0x04)  // I2C2 Alternate Function mapping
#define IO_AF4_I2C3                     ((uint8_t)0x04)  // I2C3 Alternate Function mapping
// AF 5 selection
#define IO_AF5                          ((uint8_t)0x05)  // Alternate Function mapping
#define IO_AF5_SPI                      ((uint8_t)0x05)  // SPI Alternate Function mapping
#define IO_AF5_SPI1                     ((uint8_t)0x05)  // SPI1 Alternate Function mapping
#define IO_AF5_SPI2                     ((uint8_t)0x05)  // SPI2/I2S2 Alternate Function mapping
#define IO_AF5_SPI3                     ((uint8_t)0x05)  // SPI3/I2S3 Alternate Function mapping
#define IO_AF5_SPI4                     ((uint8_t)0x05)  // SPI4 Alternate Function mapping
#define IO_AF5_SPI5                     ((uint8_t)0x05)  // SPI5 Alternate Function mapping
#define IO_AF5_SPI6                     ((uint8_t)0x05)  // SPI6 Alternate Function mapping
// AF 6 selection
#define IO_AF6                          ((uint8_t)0x06)  // Alternate Function mapping
#define IO_AF6_SPI3                     ((uint8_t)0x06)  // SPI3 Alternate Function mapping
#define IO_AF6_I2S3                     ((uint8_t)0x06)  // I2S3 Alternate Function mapping
#define IO_AF6_SAI1                     ((uint8_t)0x06)  // SAI1 Alternate Function mapping
// AF 7 selection
#define IO_AF7                          ((uint8_t)0x07)  // Alternate Function mapping
#define IO_AF7_USART1                   ((uint8_t)0x07)  // USART1 Alternate Function mapping
#define IO_AF7_USART2                   ((uint8_t)0x07)  // USART2 Alternate Function mapping
#define IO_AF7_USART3                   ((uint8_t)0x07)  // USART3 Alternate Function mapping
#define IO_AF7_I2S3ext                  ((uint8_t)0x07)  // I2S3ext Alternate Function mapping
// AF 8 selection
#define IO_AF8                          ((uint8_t)0x08)  // Alternate Function mapping
#define IO_AF8_UART4                    ((uint8_t)0x08)  // UART4 Alternate Function mapping
#define IO_AF8_UART5                    ((uint8_t)0x08)  // UART5 Alternate Function mapping
#define IO_AF8_USART6                   ((uint8_t)0x08)  // USART6 Alternate Function mapping
#define IO_AF8_UART7                    ((uint8_t)0x08)  // UART7 Alternate Function mapping
#define IO_AF8_UART8                    ((uint8_t)0x08)  // UART8 Alternate Function mapping
// AF 9 selection
#define IO_AF9                          ((uint8_t)0x09)  // Alternate Function mapping
#define IO_AF9_CAN1                     ((uint8_t)0x09)  // CAN1 Alternate Function mapping
#define IO_AF9_CAN2                     ((uint8_t)0x09)  // CAN2 Alternate Function mapping
#define IO_AF9_TIM12                    ((uint8_t)0x09)  // TIM12 Alternate Function mapping
#define IO_AF9_TIM13                    ((uint8_t)0x09)  // TIM13 Alternate Function mapping
#define IO_AF9_TIM14                    ((uint8_t)0x09)  // TIM14 Alternate Function mapping
#define IO_AF9_I2C2                     ((uint8_t)0x09)  // I2C2 Alternate Function mapping (Only for STM32F401xx Devices)
#define IO_AF9_I2C3                     ((uint8_t)0x09)  // I2C3 Alternate Function mapping (Only for STM32F401xx Devices)
// AF 10 selection
#define IO_AF10                         ((uint8_t)0x0A)  // Alternate Function mapping
#define IO_AF10_OTG_FS                  ((uint8_t)0x0A)  // OTG_FS Alternate Function mapping
#define IO_AF10_OTG_HS                  ((uint8_t)0x0A)  // OTG_HS Alternate Function mapping
// AF 11 selection
#define IO_AF11                         ((uint8_t)0x0B)  // Alternate Function mapping
#define IO_AF11_ETH                     ((uint8_t)0x0B)  // ETHERNET Alternate Function mapping
// AF 12 selection
#define IO_AF12                         ((uint8_t)0x0C)  // Alternate Function mapping
#if defined (STM32F40_41xxx)
  #define IO_AF12_FSMC                  ((uint8_t)0x0C)  // FMC Alternate Function mapping
#endif // STM32F40_41xxx
#if defined (STM32F427_437xx) || defined (STM32F429_439xx)
  #define IO_AF12_FMC                   ((uint8_t)0x0C)  // FMC Alternate Function mapping
#endif // STM32F427_437xx || STM32F429_439xx
#define IO_AF12_OTG_HS_FS               ((uint8_t)0x0C)  // OTG HS configured in FS, Alternate Function mapping
#define IO_AF12_SDIO                    ((uint8_t)0x0C)  // SDIO Alternate Function mapping
// AF 13 selection
#define IO_AF13                         ((uint8_t)0x0D)  // Alternate Function mapping
#define IO_AF13_DCMI                    ((uint8_t)0x0D)  // DCMI Alternate Function mapping
// AF 14 selection
#define IO_AF14                         ((uint8_t)0x0E)  // Alternate Function mapping
#define IO_AF14_LTDC                    ((uint8_t)0x0E)  // LCD-TFT Alternate Function mapping
// AF 15 selection
#define IO_AF15                         ((uint8_t)0x0F)  // Alternate Function mapping
#define IO_AF15_EVENTOUT                ((uint8_t)0x0F)  // EVENTOUT Alternate Function mapping

//#define IO_EXT_MODE_IT_SHIFT          (12)
#define IO_EXT_MODE_IT_PIN_MASK         ((uint32_t)0x00000003)
#define IO_EXT_MODE_IT_RISING           ((uint32_t)0x00000001)
#define IO_EXT_MODE_IT_FALLING          ((uint32_t)0x00000002)
#define IO_EXT_MODE_IT_BOTH             ((uint32_t)0x00000003)

//-------------------------------------------------------------------------------------------------
// Expand macro(s)
//-------------------------------------------------------------------------------------------------

#define EXPAND_X_IO_CFG_AS_ENUM(ENUM_ID, IO_MODE, IO_TYPE, IO_SPEED, IO_EXTRA) ENUM_ID,
#define EXPAND_X_IO_AS_ENUM(ENUM_ID, IO_PORT, IO_PIN, IO_CONFIG) ENUM_ID,
#define EXPAND_X_IO_GROUP_AS_ENUM(ENUM_ID, IO_PORT, IO_GROUP, IO_CONFIG) ENUM_ID,
#define EXPAND_X_IO_IRQ_AS_ENUM(ENUM_ID, IO_ID, NUMBER, PRIO, TRIGGER, CALLBACK, ARGUMENT) ENUM_ID,

//-------------------------------------------------------------------------------------------------
// Typedef(s)
//-------------------------------------------------------------------------------------------------

enum IO_ConfigID_e
{
    IO_CFG_DEF(EXPAND_X_IO_CFG_AS_ENUM)
    IO_CFG_NUM,
};

enum IO_ID_e
{
    IO_NOT_DEFINED = -1,
    IO_DEF(EXPAND_X_IO_AS_ENUM)
    IO_NUM_ALL,

    // Preinit IO definition are for very special case to define IO that should not be initialize by the IO_InitializeAll()
    // As a example the si4703 FM Chip need special init method by controlling RESET pin and SDA PIN to select a 2 wired mode.
  #ifdef IO_PRE_INIT_DEF
    IO_NUM_ALL_RESYNC = IO_NUM_ALL - 1,
    IO_PRE_INIT_DEF(EXPAND_X_IO_AS_ENUM)
  #endif
    IO_NUM,
};

#ifdef IO_GROUP_DEF
enum IO_GroupID_e
{
    IO_GROUP_DEF(EXPAND_X_IO_GROUP_AS_ENUM)
    IO_GROUP_NUM,
};
#endif

#ifdef IO_IRQ_DEF
enum IO_IrqID_e
{
    IO_IRQ_DEF(EXPAND_X_IO_IRQ_AS_ENUM)
    IO_IRQ_NUM,
};
#endif

typedef void (*IO_PinChangeCallback_t)(void* pArg);

//-------------------------------------------------------------------------------------------------
// Function prototype(s)
//-------------------------------------------------------------------------------------------------

void        IO_InitializeAll            (void);                                 // Init all IO and group
void        IO_PinInit                  (IO_ID_e IO_ID);
void        IO_PinInitInput             (IO_ID_e IO_ID);
void        IO_PinInitOutput            (IO_ID_e IO_ID);
#ifdef IO_GROUP_DEF
void        IO_GroupPinInit             (IO_GroupID_e IO_GroupID);
#endif
void        IO_SetPinLow                (IO_ID_e IO_ID);
void        IO_SetPinHigh               (IO_ID_e IO_ID);
void        IO_TogglePin                (IO_ID_e IO_ID);
void        IO_SetPin                   (IO_ID_e IO_ID, bool Value);
bool        IO_GetInputPin              (IO_ID_e IO_ID);
uint32_t    IO_GetInputPinValue         (IO_ID_e IO_ID);
bool        IO_GetOutputPin             (IO_ID_e IO_ID);
bool        IO_IsItValid                (IO_ID_e IO_ID);
#ifdef IO_IRQ_DEF
void        IO_PinInitIRQ               (IO_IrqID_e IO_IRQ_ID);               // Change this to put callback into BSP_IO_DEF
void        IO_EnableIRQ                (IO_IrqID_e IO_IRQ_ID);
void        IO_DisableIRQ               (IO_IrqID_e IO_IRQ_ID);
IO_ID_e     IO_GetIO_ID                 (IO_IrqID_e IO_IRQ_ID);
bool        IO_GetIRQ_State             (IO_IrqID_e IO_IRQ_ID);
void        IO_CallBack                 (IO_IrqID_e IO_IRQ_ID);
#endif

uint32_t HALIO_PinLowLevelAccess   (uint32_t PortNumber, uint32_t PinNumber, uint32_t Direction, uint32_t State);

//-------------------------------------------------------------------------------------------------
